iot-chalmers/BlueFlood/cpu/cc26xx-cc13xx/lib/cc13xxware/inc/hw_aux_evctl.h
// Field:     [5] VEC2_EN
//
// Enables (1) or disables (0) triggering of vector 2 execution.
//
// When enabled, the edge selected by VEC2_POL on the event selected by VEC2_EV
// will set VECFLAGS.VEC2, which in turn triggers vector 2 execution.
//
// Note: Lower vectors (0 and 1) have priority.
// ENUMs:
// EN                       An event selected by VEC2_EV with polarity from
//                          VEC2_POL triggers a jump to vector # 2 when
//                          AUX_SCE is in sleep
// DIS                      Event detection is disabled
#define AUX_EVCTL_VECCFG1_VEC2_EN                                   0x00000020
#define AUX_EVCTL_VECCFG1_VEC2_EN_BITN                                       5
#define AUX_EVCTL_VECCFG1_VEC2_EN_M                                 0x00000020
#define AUX_EVCTL_VECCFG1_VEC2_EN_S                                          5
#define AUX_EVCTL_VECCFG1_VEC2_EN_EN                                0x00000020
#define AUX_EVCTL_VECCFG1_VEC2_EN_DIS                               0x00000000

// Field:   [4:0] VEC2_EV
//
// Selects vector 2 trigger source event.
// ENUMs:
// ADC_IRQ                  ADC_IRQ event
// MCU_EV                   MCU_EV event
// ACLK_REF                 ACLK_REF event
// AUXIO15                  AUXIO15 input data
// AUXIO14                  AUXIO14 input data
// AUXIO13                  AUXIO13 input data
// AUXIO12                  AUXIO12 input data
// AUXIO11                  AUXIO11 input data
// AUXIO10                  AUXIO10 input data
// AUXIO9                   AUXIO9 input data
// AUXIO8                   AUXIO8 input data
// AUXIO7                   AUXIO7 input data
// AUXIO6                   AUXIO6 input data
// AUXIO5                   AUXIO5 input data
// AUXIO4                   AUXIO4 input data
// AUXIO3                   AUXIO3 input data
// AUXIO2                   AUXIO2 input data
// AUXIO1                   AUXIO1 input data
// AUXIO0                   AUXIO0 input data
// AON_PROG_WU              AON_PROG_WU event
// AON_SW                   AON_SW event
// OBSMUX1                  OBSMUX1 event
// OBSMUX0                  OBSMUX0 event
// ADC_FIFO_ALMOST_FULL     ADC_FIFO_ALMOST_FULL event
// ADC_DONE                 ADC_DONE event
// SMPH_AUTOTAKE_DONE       SMPH_AUTOTAKE_DONE event
// TIMER1_EV                TIMER1_EV event
// TIMER0_EV                TIMER0_EV event
// TDC_DONE                 TDC_DONE event
// AUX_COMPB                AUX_COMPB event
// AUX_COMPA                AUX_COMPA event
// AON_RTC_CH2              AON_RTC_CH2 event
#define AUX_EVCTL_VECCFG1_VEC2_EV_M                                 0x0000001F
#define AUX_EVCTL_VECCFG1_VEC2_EV_S                                          0
#define AUX_EVCTL_VECCFG1_VEC2_EV_ADC_IRQ                           0x0000001F
#define AUX_EVCTL_VECCFG1_VEC2_EV_MCU_EV                            0x0000001E
#define AUX_EVCTL_VECCFG1_VEC2_EV_ACLK_REF                          0x0000001D
#define AUX_EVCTL_VECCFG1_VEC2_EV_AUXIO15                           0x0000001C
#define AUX_EVCTL_VECCFG1_VEC2_EV_AUXIO14                           0x0000001B
#define AUX_EVCTL_VECCFG1_VEC2_EV_AUXIO13                           0x0000001A
#define AUX_EVCTL_VECCFG1_VEC2_EV_AUXIO12                           0x00000019
#define AUX_EVCTL_VECCFG1_VEC2_EV_AUXIO11                           0x00000018
#define AUX_EVCTL_VECCFG1_VEC2_EV_AUXIO10                           0x00000017
#define AUX_EVCTL_VECCFG1_VEC2_EV_AUXIO9                            0x00000016
#define AUX_EVCTL_VECCFG1_VEC2_EV_AUXIO8                            0x00000015
#define AUX_EVCTL_VECCFG1_VEC2_EV_AUXIO7                            0x00000014
#define AUX_EVCTL_VECCFG1_VEC2_EV_AUXIO6                            0x00000013
#define AUX_EVCTL_VECCFG1_VEC2_EV_AUXIO5                            0x00000012
#define AUX_EVCTL_VECCFG1_VEC2_EV_AUXIO4                            0x00000011
#define AUX_EVCTL_VECCFG1_VEC2_EV_AUXIO3                            0x00000010
#define AUX_EVCTL_VECCFG1_VEC2_EV_AUXIO2                            0x0000000F
#define AUX_EVCTL_VECCFG1_VEC2_EV_AUXIO1                            0x0000000E
#define AUX_EVCTL_VECCFG1_VEC2_EV_AUXIO0                            0x0000000D
#define AUX_EVCTL_VECCFG1_VEC2_EV_AON_PROG_WU                       0x0000000C
#define AUX_EVCTL_VECCFG1_VEC2_EV_AON_SW                            0x0000000B
#define AUX_EVCTL_VECCFG1_VEC2_EV_OBSMUX1                           0x0000000A
#define AUX_EVCTL_VECCFG1_VEC2_EV_OBSMUX0                           0x00000009
#define AUX_EVCTL_VECCFG1_VEC2_EV_ADC_FIFO_ALMOST_FULL              0x00000008
#define AUX_EVCTL_VECCFG1_VEC2_EV_ADC_DONE                          0x00000007
#define AUX_EVCTL_VECCFG1_VEC2_EV_SMPH_AUTOTAKE_DONE                0x00000006
#define AUX_EVCTL_VECCFG1_VEC2_EV_TIMER1_EV                         0x00000005
#define AUX_EVCTL_VECCFG1_VEC2_EV_TIMER0_EV                         0x00000004
#define AUX_EVCTL_VECCFG1_VEC2_EV_TDC_DONE                          0x00000003
#define AUX_EVCTL_VECCFG1_VEC2_EV_AUX_COMPB                         0x00000002
#define AUX_EVCTL_VECCFG1_VEC2_EV_AUX_COMPA                         0x00000001
#define AUX_EVCTL_VECCFG1_VEC2_EV_AON_RTC_CH2                       0x00000000

//*****************************************************************************
//
// Register: AUX_EVCTL_O_SCEWEVSEL
//
//*****************************************************************************
// Field:   [4:0] WEV7_EV
//
// Selects the event source to be mapped to AUX_SCE:WUSTAT.EV_SIGNALS bit 7.
// ENUMs:
// ADC_IRQ                  ADC_IRQ event
// MCU_EV                   MCU_EV event
// ACLK_REF                 ACLK_REF event
// AUXIO15                  AUXIO15 input data
// AUXIO14                  AUXIO14 input data
// AUXIO13                  AUXIO13 input data
// AUXIO12                  AUXIO12 input data
// AUXIO11                  AUXIO11 input data
// AUXIO10                  AUXIO10 input data
// AUXIO9                   AUXIO9 input data
// AUXIO8                   AUXIO8 input data
// AUXIO7                   AUXIO7 input data
// AUXIO6                   AUXIO6 input data
// AUXIO5                   AUXIO5 input data
// AUXIO4                   AUXIO4 input data
// AUXIO3                   AUXIO3 input data
// AUXIO2                   AUXIO2 input data
// AUXIO1                   AUXIO1 input data
// AUXIO0                   AUXIO0 input data
// AON_PROG_WU              AON_PROG_WU event
// AON_SW                   AON_SW event
// OBSMUX1                  OBSMUX1 event
// OBSMUX0                  OBSMUX0 event
// ADC_FIFO_ALMOST_FULL     ADC_FIFO_ALMOST_FULL event
// ADC_DONE                 ADC_DONE event
// SMPH_AUTOTAKE_DONE       SMPH_AUTOTAKE_DONE event
// TIMER1_EV                TIMER1_EV event
// TIMER0_EV                TIMER0_EV event
// TDC_DONE                 TDC_DONE event
// AUX_COMPB                AUX_COMPB event
// AUX_COMPA                AUX_COMPA event
// AON_RTC_CH2              AON_RTC_CH2 event
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_M                               0x0000001F
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_S                                        0
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_ADC_IRQ                         0x0000001F
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_MCU_EV                          0x0000001E
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_ACLK_REF                        0x0000001D
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_AUXIO15                         0x0000001C
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_AUXIO14                         0x0000001B
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_AUXIO13                         0x0000001A
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_AUXIO12                         0x00000019
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_AUXIO11                         0x00000018
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_AUXIO10                         0x00000017
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_AUXIO9                          0x00000016
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_AUXIO8                          0x00000015
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_AUXIO7                          0x00000014
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_AUXIO6                          0x00000013
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_AUXIO5                          0x00000012
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_AUXIO4                          0x00000011
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_AUXIO3                          0x00000010
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_AUXIO2                          0x0000000F
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_AUXIO1                          0x0000000E
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_AUXIO0                          0x0000000D
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_AON_PROG_WU                     0x0000000C
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_AON_SW                          0x0000000B
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_OBSMUX1                         0x0000000A
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_OBSMUX0                         0x00000009
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_ADC_FIFO_ALMOST_FULL            0x00000008
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_ADC_DONE                        0x00000007
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_SMPH_AUTOTAKE_DONE              0x00000006
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_TIMER1_EV                       0x00000005
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_TIMER0_EV                       0x00000004
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_TDC_DONE                        0x00000003
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_AUX_COMPB                       0x00000002
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_AUX_COMPA                       0x00000001
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_AON_RTC_CH2                     0x00000000

//*****************************************************************************
//
// Register: AUX_EVCTL_O_EVTOAONFLAGS
//
//*****************************************************************************
// Field:     [8] TIMER1_EV
//
// TIMER1_EV event flag.
#define AUX_EVCTL_EVTOAONFLAGS_TIMER1_EV                            0x00000100
#define AUX_EVCTL_EVTOAONFLAGS_TIMER1_EV_BITN                                8
#define AUX_EVCTL_EVTOAONFLAGS_TIMER1_EV_M                          0x00000100
#define AUX_EVCTL_EVTOAONFLAGS_TIMER1_EV_S                                   8

